const readyMaps = [
    {
        title: "همه",
        id: "all",
        active: true
    },
    {
        title: "موبایل",
        id: "mobile",
        active: false,
        list: [
            {
                name: "Kotlin",
                img: "mobile/katlin.png",
                rate: 3.8,
                desc: "زبان برنامه نویسی کاتلین (Kotlin) زبان رسمی برای برنامه نویسی اندروید به حساب می‌آید که توسط گوگل یعنی سازنده‌ این سیستم‌عامل معرفی شده است. زبان کاتلین در چند سال گذشته توانسته به محبوبیت بالایی دست پیدا کند و رقیب اصلی خود یعنی زبان جاوا را از پیش رو بردارد."
            },
            {
                name: "Java",
                img: "mobile/java.png",
                rate: 4.5,
                desc: "جاوا یک زبان برنامه‌نویسی شی‌گرا و قدرتمند است که توسط شرکت Sun Microsystems در دهه 90 میلادی معرفی شد. این زبان به دلیل ویژگی‌هایی مانند امنیت بالا، سازگاری با پلتفرم‌های مختلف و قابلیت‌های شی‌گرایی، به یکی از محبوب‌ترین زبان‌های برنامه‌نویسی در جهان تبدیل شده است."
            },
            {
                name: "Swift",
                img: "mobile/swift.webp",
                rate: 3.5,
                desc: "زبان برنامه‌نویسی سوئیفت یک زبان مدرن و متن‌باز است که توسط شرکت اپل برای توسعه برنامه‌های iOS، macOS، watchOS و tvOS طراحی شده است. این زبان به منظور جایگزینی Objective-C توسعه یافته و از مفاهیم برنامه‌نویسی مدرن مانند برنامه‌نویسی تابعی و شی‌گرا پشتیبانی می‌کند. سوئیفت به گونه‌ای طراحی شده است که خوانا، ایمن و کارآمد باشد و از ویژگی‌هایی مانند مدیریت خودکار حافظه و پشتیبانی از پروتکل‌ها بهره می‌برد."
            },
            {
                name: "Flutter",
                img: "mobile/flutter.png",
                rate: 3.2,
                desc: "فلاتر یک فریمورک متن‌باز توسعهٔ نرم‌افزار است که توسط گوگل توسعه داده شده است. از این فریمورک برای ساخت رابط‌های کاربری (UI) برای برنامه‌های چندسکویی (cross-platform) مانند اندروید و iOS استفاده می‌شود. فلاتر از زبان برنامه‌نویسی دارت (Dart) استفاده می‌کند و به توسعه‌دهندگان امکان می‌دهد با یک کد واحد، برنامه‌هایی برای سیستم‌عامل‌های مختلف ایجاد کنند. "
            },
            {
                name: "React Native",
                img: "mobile/react-native.jpg",
                rate: 4.0,
                desc: "React Native یک چارچوب متن‌باز (open-source) برای توسعه برنامه‌های موبایل است که توسط فیسبوک توسعه داده شده است. این فریم‌ورک به توسعه‌دهندگان امکان می‌دهد تا با استفاده از جاوا اسکریپت و React، برنامه‌هایی برای سیستم‌عامل‌های iOS و اندروید بسازند. به عبارت دیگر، به جای استفاده از زبان‌های بومی هر پلتفرم (مانند جاوا/کاتلین برای اندروید و آبجکتیو-سی/سوئیفت برای iOS)، می‌توان با یک کد مشترک، اپلیکیشن‌هایی با عملکرد مشابه اپلیکیشن‌های بومی تولید کرد."
            },
            {
                name: "Xamarin (.NET)",
                img: "mobile/xamarin.png",
                rate: 2.8,
                desc: "زامارین (Xamarin) یک پلتفرم متن‌باز برای توسعه برنامه‌های بومی (native) برای سیستم‌عامل‌های مختلف (مثل iOS، Android و Windows) با استفاده از زبان C# و .NET است. به عبارت دیگر، با زامارین می‌توانید یک بار کد بنویسید و از آن برای ساخت برنامه‌هایی با ظاهر و عملکرد بومی در دستگاه‌های مختلف استفاده کنید. "
            },
            {
                name: "Firebase",
                img: "mobile/firebase.png",
                rate: 3.7,
                desc: "فایربیس (‌Firebase) یک پلتفرم قدرتمند برای ساخت اپلیکیشن‌های وب و موبایل است. این پلتفرم می‌تواند قدرت بک‌اند اپلیکیشن‌ها را تأمین کند که شامل کارکردهایی از قبیل ذخیره داده، احراز هویت کاربر، هاستینگ استاتیک و موارد بسیار دیگر می‌شود."
            },
            {
                name: "Jetpack Compose",
                img: "mobile/jetpackCompose.png",
                rate: 3.5,
                desc: "جت‌ پک کامپوز (Jetpack Compose) یک ابزار مدرن برای طراحی رابط کاربری (UI) در برنامه‌های اندروید است که توسط گوگل معرفی شده است. این فریمورک با استفاده از زبان برنامه‌نویسی کاتلین (Kotlin) کار می‌کند و به توسعه‌دهندگان این امکان را می‌دهد تا رابط‌های کاربری خود را به صورت اعلان‌کننده (declarative) و با کد کمتر و خواناتری نسبت به روش‌های سنتی طراحی کنند. "
            }
        ]
    },
    {
        title: "طراحی سایت",
        id: "webDesiner",
        active: false,
        list: [
            {
                name: "Html/Css",
                img: "webdesign/htmlcss.png",
                rate: 5.0,
                desc: "HTML ساختار و محتوای صفحات وب را مشخص می‌کند (مثل تیترها، متن‌ها، تصاویر و لینک‌ها)، در حالی که CSS ظاهر و طراحی آن‌ها را کنترل می‌کند (مثل رنگ، اندازه، فونت و چیدمان). این دو فناوری پایه‌های اصلی طراحی سایت هستند."
            },
            {
                name: "JavaScript",
                img: "webdesign/javascript.png",
                rate: 5.0,
                desc: "جاوااسکریپت زبان برنامه‌نویسی‌ای است که به صفحات وب رفتار و پویایی می‌بخشد. با کمک آن می‌توان تعامل با کاربر، انیمیشن‌ها، تغییرات زنده در محتوا و حتی برنامه‌های کامل وب را ساخت. این زبان مکمل HTML و CSS است."
            },
            {
                name: "React.js",
                img: "webdesign/reactjs.jpeg",
                rate: 4.8,
                desc: "React.js یک کتابخانه‌ی قدرتمند جاوااسکریپت است که توسط فیسبوک توسعه یافته و برای ساخت رابط کاربری (UI) در وب‌اپلیکیشن‌ها استفاده می‌شود. با استفاده از کامپوننت‌ها، توسعه‌دهنده می‌تواند بخش‌های مختلف صفحه را به‌صورت مستقل و قابل‌مدیریت طراحی کند."
            },
            {
                name: "Vue.js",
                img: "webdesign/vuejs.jpg",
                rate: 4.2,
                desc: "Vue.js یک فریم‌ورک سبک و انعطاف‌پذیر جاوااسکریپت است که برای ساخت رابط‌های کاربری و اپلیکیشن‌های تک‌صفحه‌ای (SPA) استفاده می‌شود. یادگیری آسان، ساختار ساده و قدرت بالا، Vue را به انتخابی محبوب برای توسعه‌دهندگان وب تبدیل کرده است."
            },
            {
                name: "Angular",
                img: "webdesign/angular.png",
                rate: 3.9,
                desc: "Angular یک فریم‌ورک قدرتمند و ساخت‌یافته‌ی جاوااسکریپت (توسعه‌یافته توسط گوگل) است که برای ساخت اپلیکیشن‌های وب بزرگ، پویا و مقیاس‌پذیر استفاده می‌شود. این فریم‌ورک بر پایه‌ی TypeScript ساخته شده و امکاناتی مانند دوطرفه‌سازی داده، مسیریابی، و تزریق وابستگی را به‌صورت یکپارچه ارائه می‌دهد."
            },
            {
                name: "Next.js",
                img: "webdesign/nextjs.webp",
                rate: 4.0,
                desc: "Next.js یک فریم‌ورک مدرن بر پایه React است که توسعه‌ی اپلیکیشن‌های وب سریع، سئو‌محور و مقیاس‌پذیر را ساده می‌کند. این فریم‌ورک امکاناتی مانند رندر سمت سرور (SSR)، تولید استاتیک، مسیریابی خودکار و بهینه‌سازی عملکرد را به‌صورت پیش‌فرض ارائه می‌دهد."
            },
            {
                name: "Tailwind.CSS",
                img: "webdesign/tailwind.jpg",
                rate: 4.3,
                desc: "Tailwind CSS یک فریم‌ورک utility-first برای طراحی رابط کاربری است که به جای نوشتن کلاس‌های سفارشی، از کلاس‌های آماده و از پیش تعریف‌شده استفاده می‌کند. این روش به توسعه‌دهنده کمک می‌کند تا سریع‌تر و با کنترل بیشتر، ظاهر صفحات را طراحی کند."
            },
            {
                name: "Node.js",
                img: "webdesign/nodejs.png",
                rate: 4.6,
                desc: "Node.js یک محیط اجرایی برای جاوااسکریپت است که به شما اجازه می‌دهد کدهای جاوااسکریپت را خارج از مرورگر، مثلاً در سمت سرور اجرا کنید. این پلتفرم برای ساخت اپلیکیشن‌های مقیاس‌پذیر، سریع و رویدادمحور مانند APIها و سرویس‌های وب بسیار مناسب است."
            },
            {
                name: "Express.js",
                img: "webdesign/expressjs.png",
                rate: 4.4,
                desc: "Express.js یک فریم‌ورک سبک و انعطاف‌پذیر برای Node.js است که ساخت سرور و API را بسیار ساده و سریع می‌کند. این فریم‌ورک با فراهم‌کردن ابزارهای متنوع برای مدیریت درخواست‌ها، مسیرها و میدل‌ورها، توسعه‌ی وب‌اپلیکیشن‌ها را آسان‌تر می‌سازد."
            },
            {
                name: "PHP",
                img: "webdesign/php.jpg",
                rate: 3.5,
                desc: "PHP یک زبان برنامه‌نویسی سمت سرور است که برای ساخت وب‌سایت‌ها و اپلیکیشن‌های دینامیک استفاده می‌شود. این زبان محبوب، آسان برای یادگیری و با پشتیبانی گسترده، به توسعه‌دهندگان امکان می‌دهد محتوای وب را به‌صورت پویا تولید کنند."
            }, {
                name: "Laravel",
                img: "webdesign/laravel.webp",
                rate: 3.6,
                desc: "Laravel یک فریم‌ورک قدرتمند و محبوب PHP است که توسعه اپلیکیشن‌های وب را سریع‌تر، ساخت‌یافته‌تر و آسان‌تر می‌کند. این فریم‌ورک امکاناتی مثل مسیریابی، مدیریت پایگاه داده، قالب‌بندی و امنیت را به‌صورت یکپارچه فراهم می‌کند."
            },
            {
                name: "Python",
                img: "webdesign/python.webp",
                rate: 4.5,
                desc: "Python یک زبان برنامه‌نویسی سطح بالا، ساده و خواناست که به‌خاطر انعطاف‌پذیری و قدرتش در زمینه‌های مختلفی مثل توسعه وب، علم داده، هوش مصنوعی و خودکارسازی کاربرد فراوان دارد"
            },
            {
                name: "Django",
                img: "webdesign/django.jpeg",
                rate: 4.7,
                desc: "Django یک فریم‌ورک قدرتمند و سطح‌بالای Python است که ساخت وب‌اپلیکیشن‌های امن، سریع و مقیاس‌پذیر را ساده می‌کند. با معماری MTV و امکانات آماده مثل مدیریت دیتابیس و احراز هویت، توسعه‌دهندگان را در ایجاد برنامه‌های پیچیده همراهی می‌کند."
            },
            {
                name: "MySQL",
                img: "webdesign/mysql.png",
                rate: 4.5,
                desc: "MySQL یک سیستم مدیریت پایگاه داده رابطه‌ای (RDBMS) متن‌باز است که برای ذخیره، سازماندهی و مدیریت داده‌ها در اپلیکیشن‌ها و وب‌سایت‌ها استفاده می‌شود. این سیستم به‌خاطر سرعت، امنیت و قابلیت اطمینانش بسیار محبوب است."
            },
            {
                name: "MongoDB",
                img: "webdesign/mongoDB.webp",
                rate: 4.5,
                desc: "MongoDB یک پایگاه داده‌ی غیررابطه‌ای (NoSQL) است که داده‌ها را به‌صورت سندهای JSON مانند ذخیره می‌کند. این ساختار منعطف و مقیاس‌پذیر، برای پروژه‌های مدرن وب و اپلیکیشن‌های با داده‌های پیچیده بسیار مناسب است."
            },
            {
                name: "PostgreSQL",
                img: "webdesign/PostgreSQL.png",
                rate: 4.5,
                desc: "PostgreSQL یک سیستم مدیریت پایگاه داده رابطه‌ای (RDBMS) متن‌باز و پیشرفته است که امکانات قدرتمندی مثل تراکنش‌های پیچیده، پشتیبانی از داده‌های فضایی و توسعه‌پذیری بالا را فراهم می‌کند. این پایگاه داده برای برنامه‌های بزرگ و حساس بسیار مناسب است."
            },
            {
                name: "GraphQL",
                img: "webdesign/graphQL.jpg",
                rate: 4.4,
                desc: "GraphQL یک زبان پرس‌وجو برای APIهاست که به کلاینت‌ها اجازه می‌دهد دقیقاً داده‌های مورد نیازشان را درخواست کنند. این روش باعث کاهش حجم داده‌های منتقل‌شده و افزایش سرعت پاسخ‌گویی می‌شود و توسعه APIهای انعطاف‌پذیرتر را ساده می‌کند."
            },
            {
                name: "REST API",
                img: "webdesign/restApi.webp",
                rate: 4.4,
                desc: "REST API یک سبک طراحی برای ساخت سرویس‌های وب است که با استفاده از پروتکل HTTP، امکان تبادل داده‌ها بین کلاینت و سرور را به‌صورت ساده و استاندارد فراهم می‌کند. این روش توسعه برنامه‌های توزیع‌شده و مقیاس‌پذیر را آسان می‌کند."
            },
            {
                name: "Docker",
                img: "webdesign/docker.png",
                rate: 4.7,
                desc: "Docker یک پلتفرم متن‌باز برای ساخت، ارسال و اجرای برنامه‌ها در محیط‌های ایزوله به نام کانتینر است. این روش باعث می‌شود نرم‌افزارها روی هر سیستمی با همان شرایط اجرا شوند و توسعه و استقرار آن‌ها ساده‌تر و سریع‌تر شود."
            },
            {
                name: "bootstrap",
                img: "webdesign/bootstrap.webp",
                rate: 4.4,
                desc: "Bootstrap یک فریم‌ورک محبوب CSS است که ابزارهایی آماده برای طراحی سریع و واکنش‌گرا (Responsive) صفحات وب فراهم می‌کند. این فریم‌ورک شامل مجموعه‌ای از کلاس‌ها، کامپوننت‌ها و طراحی‌های از پیش‌ساخته شده است که روند ساخت رابط کاربری را بسیار ساده‌تر می‌کند."
            },
            {
                name: "mui",
                img: "webdesign/materialui.png",
                rate: 4.7,
                desc: "MUI یک کتابخانه‌ی محبوب React بر پایه طراحی متریال دیزاین گوگل است که مجموعه‌ای از کامپوننت‌های آماده و قابل‌سفارشی‌سازی را برای ساخت رابط کاربری زیبا و مدرن فراهم می‌کند. استفاده از MUI توسعه رابط‌های کاربری را سریع‌تر و منسجم‌تر می‌سازد."
            },
            {
                name: "sass",
                img: "webdesign/sass.webp",
                rate: 4.6,
                desc: "Sass یک پیش‌پردازنده‌ی CSS است که امکاناتی مثل متغیرها، توابع، تو در تویی و ماژول‌بندی را به استایل‌دهی صفحات اضافه می‌کند. با استفاده از Sass، نوشتن و مدیریت کدهای CSS آسان‌تر، منظم‌تر و قابل نگهداری‌تر می‌شود."
            }
        ]
    },
    {
        title: "طراحی(UI/UX)",
        id: "UIUX",
        active: false,
        list: [
            {
                name: "Figma",
                img: "design/figma.png",
                rate: 4.6,
                desc: "Figma یک ابزار طراحی رابط کاربری (UI) و تجربه کاربری (UX) مبتنی بر وب است که به طراحان اجازه می‌دهد به‌صورت آنلاین و هم‌زمان روی پروژه‌ها کار کنند. این ابزار برای طراحی، نمونه‌سازی و همکاری تیمی بسیار قدرتمند و محبوب است."
            },
            {
                name: "Adobe XD",
                img: "design/xd.jpg",
                rate: 4.0,
                desc: "Adobe XD یک ابزار حرفه‌ای برای طراحی رابط کاربری (UI) و تجربه کاربری (UX) است که به طراحان کمک می‌کند صفحات وب و اپلیکیشن‌ها را طراحی، نمونه‌سازی و تست کنند. این نرم‌افزار با رابط کاربری ساده و امکانات پیشرفته، برای طراحی تعاملی بسیار کاربردی است."
            },
            {
                name: "Sketch",
                img: "design/sketch.png",
                rate: 3.8,
                desc: "Sketch یک نرم‌افزار طراحی رابط کاربری (UI) و تجربه کاربری (UX) مخصوص سیستم‌عامل macOS است که برای طراحی صفحات وب، اپلیکیشن‌ها و نمونه‌های تعاملی استفاده می‌شود. این ابزار با تمرکز بر طراحی دیجیتال، در بین طراحان حرفه‌ای بسیار محبوب است."
            },
            {
                name: "Photoshop",
                img: "design/photoshop.png",
                rate: 4.2,
                desc: "Photoshop یک نرم‌افزار حرفه‌ای و قدرتمند از شرکت Adobe است که برای ویرایش تصاویر، طراحی گرافیکی و خلق محتوای بصری استفاده می‌شود. این ابزار پرکاربرد در زمینه‌هایی مانند طراحی وب، عکاسی، تبلیغات و هنر دیجیتال بسیار محبوب است."
            },
            {
                name: "Illustrator",
                img: "design/illustrator.webp",
                rate: 4.0,
                desc: "Illustrator یک نرم‌افزار حرفه‌ای از شرکت Adobe برای طراحی و ویرایش گرافیک‌های برداری (وکتور) است. این ابزار برای طراحی لوگو، آیکون، پوستر، کاراکتر و آثار هنری دیجیتال کاربرد دارد و خروجی‌های آن بدون افت کیفیت در هر اندازه قابل استفاده‌اند."
            },
            {
                name: "Canva",
                img: "design/canva.webp",
                rate: 3.7,
                desc: "Canva یک ابزار طراحی آنلاین و کاربرپسند است که به افراد حتی بدون دانش گرافیکی، امکان ساخت پوستر، پست شبکه‌های اجتماعی، ارائه، رزومه و انواع طرح‌های گرافیکی را با قالب‌های آماده و امکانات ساده می‌دهد"
            },
            {
                name: "After Effects",
                img: "design/aftereffects.webp",
                rate: 3.6,
                desc: "After Effects یک نرم‌افزار حرفه‌ای از شرکت Adobe برای ساخت موشن گرافیک، جلوه‌های ویژه بصری (VFX) و انیمیشن‌های ویدیویی است. این ابزار در تولید ویدیوهای تبلیغاتی، تیزر، تیتراژ فیلم و محتوای دیجیتال بسیار کاربرد دارد."
            }
        ]
    },
    {
        title: "دسکتاپ",
        id: "desktop",
        active: false,
        list: [
            {
                name: "C# Wpf",
                img: "desktop/wpf.png",
                rate: 4.0,
                desc: "Windows Presentation Foundation (WPF) یک فریم‌ورک گرافیکی برای ساخت برنامه‌های دسکتاپ در محیط ویندوز با زبان C# است. WPF امکان طراحی رابط‌های کاربری زیبا، پویا و با امکانات پیشرفته مانند انیمیشن و داده‌پردازی را فراهم می‌کند."
            },
            {
                name: "C# winform",
                img: "desktop/winform.jpg",
                rate: 3.9,
                desc: "WinForms یک فریم‌ورک قدیمی و ساده برای ساخت برنامه‌های دسکتاپ ویندوز با زبان C# است. این فریم‌ورک با استفاده از کنترل‌های گرافیکی آماده، توسعه سریع رابط‌های کاربری کلاسیک را ممکن می‌سازد"
            },
            {
                name: "Electron.js",
                img: "desktop/electron.png",
                rate: 4.3,
                desc: "Electron یک فریم‌ورک متن‌باز است که به توسعه‌دهندگان امکان می‌دهد با استفاده از HTML، CSS و JavaScript اپلیکیشن‌های دسکتاپ چندسکویی (ویندوز، مک و لینوکس) بسازند. این فریم‌ورک قدرت Node.js و موتور مرورگر Chromium را ترکیب می‌کند."
            },
            {
                name: "JavaFx",
                img: "desktop/javafx.jpg",
                rate: 3.5,
                desc: "JavaFX یک کتابخانه و فریم‌ورک گرافیکی برای زبان برنامه‌نویسی Java است که به توسعه‌دهندگان امکان می‌دهد برنامه‌های دسکتاپ با رابط کاربری زیبا، تعاملی و چندرسانه‌ای بسازند. این فریم‌ورک جایگزینی مدرن برای Swing محسوب می‌شود."
            },
            {
                name: "Tkinter Python",
                img: "desktop/tkinter.webp",
                rate: 3.8,
                desc: "در زبان برنامه‌نویسی پایتون، Tkinter یک کتابخانه واسط کاربر گرافیکی (GUI) استاندارد است. این کتابخانه به برنامه‌نویسان امکان می‌دهد تا برنامه‌هایی با رابط‌های کاربری گرافیکی جذاب و تعاملی بسازند. Tkinter با پایتون همراه است و نیازی به نصب جداگانه ندارد. "
            },
            {
                name: "PyQt Python",
                img: "desktop/pyqt.png",
                rate: 3.8,
                desc: "PyQt یک کتابخانه پایتون است که برای ایجاد رابط‌های کاربری گرافیکی (GUI) در برنامه‌های پایتون استفاده می‌شود. این کتابخانه بر اساس فریمورک قدرتمند Qt توسعه یافته و امکان ساخت برنامه‌هایی با واسط کاربری زیبا و حرفه‌ای را در پایتون فراهم می‌کند. PyQt به برنامه‌نویسان این امکان را می‌دهد تا با استفاده از زبان پایتون، برنامه‌های بومی Qt را بسازند که قابلیت اجرا در سیستم عامل‌های مختلفی مانند ویندوز، macOS، لینوکس، iOS و اندروید را دارند. "
            }
            ,
            {
                name: "++Qt C",
                img: "desktop/qtc++.png",
                rate: 4.1,
                desc: "Qt در C++ یک فریم‌ورک (چارچوب) توسعه نرم‌افزار چندسکویی است که برای ساخت برنامه‌های کاربردی با رابط کاربری گرافیکی (GUI) و سایر انواع برنامه‌ها استفاده می‌شود [1، 2]. Qt به زبان C++ نوشته شده است و به توسعه‌دهندگان امکان می‌دهد تا برنامه‌هایی با کارایی بالا و طراحی زیبا ایجاد کنند."
            }
            ,
            {
                name: "Tauri rust",
                img: "desktop/tauri.jpeg",
                rate: 3.7,
                desc: "Tauri یک چارچوب نرم‌افزاری متن‌باز است که برای ساخت برنامه‌های دسکتاپ و تلفن همراه چندسکویی (cross-platform) با استفاده از زبان برنامه‌نویسی Rust در سمت سرور (backend) و صفحه وب در سمت کاربر (frontend) استفاده می‌شود. به عبارت دیگر، Tauri به توسعه‌دهندگان این امکان را می‌دهد تا با استفاده از فناوری‌های وب مانند HTML, CSS و JavaScript، برنامه‌هایی بسازند که روی سیستم‌عامل‌های مختلف مانند ویندوز، macOS و لینوکس اجرا شوند و در عین حال، از مزایای زبان Rust در بهینه‌سازی و عملکرد برنامه بهره‌مند شوند. "
            }
        ]
    },
    {
        title: "هوش مصنوعی",
        id: "AI",
        active: false,
        list: [
            {
                name: "Python",
                img: "webdesign/python.webp",
                rate: 4.5,
                desc: "Python یک زبان برنامه‌نویسی سطح بالا، ساده و خواناست که به‌خاطر انعطاف‌پذیری و قدرتش در زمینه‌های مختلفی مثل توسعه وب، علم داده، هوش مصنوعی و خودکارسازی کاربرد فراوان دارد"
            },
            {
                name: "NumPy",
                img: "AI/numpy.png",
                rate: 4.8,
                desc: "NumPy یک کتابخانه‌ی قدرتمند در زبان Python است که برای انجام محاسبات عددی و کار با آرایه‌ها و ماتریس‌های چندبعدی استفاده می‌شود. این کتابخانه توابع و ابزارهای پیشرفته‌ای برای تحلیل داده‌ها و محاسبات علمی فراهم می‌کند."
            },
            {
                name: "Pandas",
                img: "AI/pandas.jpeg",
                rate: 4.8,
                desc: "Pandas یک کتابخانه‌ی پرکاربرد در زبان Python است که برای تحلیل، پاک‌سازی و مدیریت داده‌ها به‌ویژه داده‌های جدولی (مانند فایل‌های Excel و CSV) استفاده می‌شود. این ابزار امکان پردازش سریع و آسان داده‌ها را در پروژه‌های علم داده فراهم می‌کند."
            },
            {
                name: "scikit-learn",
                img: "AI/scikitlearn.png",
                rate: 4.6,
                desc: "سایکیت-لرن (scikit-learn) یک کتابخانه متن‌باز و رایگان برای یادگیری ماشین در زبان برنامه‌نویسی پایتون است. این کتابخانه ابزارهای متنوعی را برای پیاده‌سازی الگوریتم‌های مختلف یادگیری ماشین، از جمله یادگیری نظارت‌شده و بدون نظارت، در اختیار کاربران قرار می‌دهد."
            },
            {
                name: "TensorFlow",
                img: "AI/tensorflow.webp",
                rate: 4.7,
                desc: "TensorFlow یک کتابخانه‌ی متن‌باز و قدرتمند از شرکت گوگل است که برای ساخت و آموزش مدل‌های یادگیری ماشین و یادگیری عمیق استفاده می‌شود. این ابزار در پروژه‌های مرتبط با هوش مصنوعی، بینایی ماشین، پردازش زبان و تحلیل داده‌های پیچیده کاربرد فراوان دارد."
            },
            {
                name: "PyTorch",
                img: "AI/pytorch.avif",
                rate: 4.8,
                desc: "PyTorch یک کتابخانه‌ی متن‌باز برای یادگیری ماشین و یادگیری عمیق است که توسط Facebook توسعه یافته است. این ابزار با رابطی ساده و انعطاف‌پذیر، ساخت و آموزش مدل‌های هوش مصنوعی را برای پژوهشگران و توسعه‌دهندگان آسان می‌کند."
            },
            {
                name: "OpenCV",
                img: "AI/opencv.png",
                rate: 4.0,
                desc: "OpenCV یک کتابخانه‌ی متن‌باز و قدرتمند برای پردازش تصویر و بینایی ماشین است. این ابزار با پشتیبانی از زبان‌هایی مثل Python و C++، امکان شناسایی چهره، تشخیص حرکت، فیلترگذاری تصویر و بسیاری از کاربردهای هوش مصنوعی را فراهم می‌کند."
            },
            {
                name: "NLTK",
                img: "AI/nltk.jpg",
                rate: 3.9,
                desc: "NLTK (Natural Language Toolkit) یک کتابخانه‌ی قدرتمند در Python برای پردازش زبان طبیعی (NLP) است. این ابزار امکاناتی مانند توکن‌سازی، ریشه‌یابی، برچسب‌گذاری دستور زبان و تحلیل متون را برای تحلیل و درک زبان انسانی فراهم می‌کند."
            },
            {
                name: "Hugging Face",
                img: "AI/huggingface.jpg",
                rate: 4.2,
                desc: "Hugging Face یک پلتفرم و مجموعه‌ ابزار متن‌باز در زمینه هوش مصنوعی و پردازش زبان طبیعی (NLP) است که دسترسی به مدل‌های آماده مانند BERT، GPT و ابزارهای آموزش، ارزیابی و به‌کارگیری مدل‌های یادگیری ماشین را آسان می‌کند."
            }
        ]
    },
    {
        title: "سیستم و سخت افزار",
        id: "system",
        active: false,
        list: [
            {
                name: "++C",
                img: "system/Cplusplus.png",
                rate: 4.9,
                desc: "++C یک زبان برنامه‌نویسی قدرتمند، سطح میانی و شی‌گرا است که برای ساخت نرم‌افزارهای سیستم‌عامل، بازی‌ها، برنامه‌های گرافیکی و پردازش‌های سریع استفاده می‌شود. این زبان ترکیبی از سرعت زبان C و امکانات برنامه‌نویسی شی‌گرا را ارائه می‌دهد."
            },
            {
                name: "Rust",
                img: "system/rust.jpg",
                rate: 4.2,
                desc: "Rust یک زبان برنامه‌نویسی مدرن، سریع و ایمن است که برای توسعه سیستم‌های نرم‌افزاری با عملکرد بالا طراحی شده است. این زبان با تمرکز بر مدیریت حافظه بدون نیاز به garbage collector، امنیت بالا و هم‌زمانی کارآمد، در بین توسعه‌دهندگان حرفه‌ای بسیار محبوب است."
            },
            {
                name: "Assembly",
                img: "system/assembly.jpeg",
                rate: 3.5,
                desc: "Assembly (زبان اسمبلی) یک زبان برنامه‌نویسی سطح پایین است که مستقیماً با سخت‌افزار در ارتباط است. این زبان به برنامه‌نویس امکان کنترل دقیق پردازنده، حافظه و منابع سیستم را می‌دهد و معمولاً برای برنامه‌نویسی سیستم‌های تعبیه‌شده، درایورها و بهینه‌سازی‌های سطح پایین استفاده می‌شود"
            },
            {
                name: "Embedded C",
                img: "system/embedded.jpeg",
                rate: 3.8,
                desc: "Embedded C نسخه‌ای از زبان C است که مخصوص برنامه‌نویسی میکروکنترلرها و سیستم‌های تعبیه‌شده طراحی شده است. این زبان با افزودن امکانات خاص برای کنترل سخت‌افزار، توسعه نرم‌افزارهای کم‌حجم و کارآمد در دستگاه‌های الکترونیکی را ممکن می‌سازد."
            },
            {
                name: "bash",
                img: "system/bash.jpeg",
                rate: 4.4,
                desc: "Bash (Bourne Again SHell) یک زبان اسکریپت‌نویسی و پوسته (Shell) محبوب در سیستم‌های عامل لینوکس و یونیکس است که به کاربران امکان می‌دهد دستورات را به‌صورت خودکار اجرا و مدیریت کنند و کارهای تکراری را ساده‌تر کنند."
            }
        ]
    },
    {
        title: "بازی سازی",
        id: "game",
        active: false,
        list: [
            {
                name: "Unity",
                img: "game/unity.webp",
                rate: 4.6,
                desc: "Unity یک موتور بازی‌سازی قدرتمند و چندسکویی است که به توسعه‌دهندگان امکان ساخت بازی‌های دوبعدی و سه‌بعدی برای پلتفرم‌های مختلف مثل ویندوز، موبایل، کنسول و وب را می‌دهد. برنامه‌نویسی در Unity عمدتاً با زبان C# انجام می‌شود؛ توسعه‌دهندگان با نوشتن اسکریپت‌های C# می‌توانند رفتار بازی، منطق گیم‌پلی و تعاملات کاربر را کنترل کنند."
            },
            {
                name: "Unreal",
                img: "game/unreal.png",
                rate: 4.5,
                desc: "Unreal Engine یک موتور بازی‌سازی پیشرفته و قدرتمند است که توسط شرکت Epic Games توسعه یافته است. این موتور با استفاده از فناوری‌های گرافیکی سطح بالا و ابزارهای قدرتمند، امکان ساخت بازی‌های واقع‌گرایانه، سه‌بعدی و با کیفیت بالا را برای پلتفرم‌های مختلف فراهم می‌کند. برنامه‌نویسی در Unreal معمولاً با زبان C++ و سیستم بصری Blueprints انجام می‌شود."
            },
            {
                name: "Blender",
                img: "game/blender.jpg",
                rate: 4.2,
                desc: "Blender یک نرم‌افزار متن‌باز و قدرتمند برای طراحی سه‌بعدی، انیمیشن، مدل‌سازی، رندرینگ و تدوین ویدیو است. در نسخه‌های قدیمی‌تر، Blender دارای یک موتور بازی‌سازی داخلی بود، اما در نسخه‌های جدید تمرکز آن بیشتر بر تولید محتوا برای بازی‌هاست. توسعه‌دهندگان می‌توانند با استفاده از Blender مدل‌ها، انیمیشن‌ها و صحنه‌های سه‌بعدی بسازند و آن‌ها را به موتورهای بازی‌سازی مانند Unity یا Unreal منتقل کنند."
            },
            {
                name: "Game Maker",
                img: "game/gamemaker.jpg",
                rate: 3.2,
                desc: "GameMaker یک موتور بازی‌سازی ساده و قدرتمند است که به ویژه برای ساخت بازی‌های دوبعدی طراحی شده است. این موتور به کاربران اجازه می‌دهد بدون نیاز به دانش عمیق برنامه‌نویسی، بازی بسازند. با این حال، برای امکانات پیشرفته‌تر می‌توان از زبان اختصاصی آن به نام GML (GameMaker Language) استفاده کرد."
            },
            {
                name: "Constructor3",
                img: "game/constructor3.jpg",
                rate: 2.8,
                desc: "Construct 3 یک موتور بازی‌سازی تحت وب است که به کاربران اجازه می‌دهد بدون نیاز به برنامه‌نویسی، بازی‌های دوبعدی بسازند. این پلتفرم با استفاده از سیستم 'کشیدن و رها کردن' و منطق رویدادمحور، برای مبتدی‌ها و طراحان بازی بسیار مناسب است. Construct 3 برای ساخت سریع بازی‌های HTML5، موبایل و دسکتاپ استفاده می‌شود."
            },
            {
                name: "Godot",
                img: "game/godot.webp",
                rate: 3.9,
                desc: "Godot یک موتور بازی‌سازی رایگان و متن‌باز است که برای ساخت بازی‌های دوبعدی و سه‌بعدی طراحی شده است. این موتور دارای زبان اسکریپت‌نویسی اختصاصی به نام GDScript است که شبیه پایتون است و یادگیری آن آسان می‌باشد. همچنین از زبان‌های C#, C++ و VisualScript نیز پشتیبانی می‌کند. Godot به‌خاطر سبک بودن، قابلیت گسترش بالا و عدم نیاز به پرداخت حق امتیاز بسیار محبوب است."
            },
            {
                name: "Three.js",
                img: "game/threejs.png",
                rate: 3.8,
                desc: "Three.js یک کتابخانه‌ی جاوااسکریپت است که امکان ساخت و نمایش گرافیک‌های سه‌بعدی را در مرورگر، با استفاده از WebGL فراهم می‌کند. این ابزار به توسعه‌دهندگان وب اجازه می‌دهد بدون نیاز به دانش عمیق گرافیک، صحنه‌های سه‌بعدی، انیمیشن و بازی‌های ساده را به‌صورت تعاملی پیاده‌سازی کنند."
            }
        ]
    }
]
export default readyMaps;